
# coding: utf-8

# In[ ]:


#oculist_keyword_web="tri-z" # subset of oculist from work_place

import re

""" Defining words/hashtags for post_keyword_finder.py:
    
"""

#list of all hashtags 
words_str="'#глаза','#глазки', '#зрение', '#лечениезрения', '#детскоезрение', '#лечениеглаз','#офтальмолог','#офтальмология',\
		   '#офтальмохирург', '#офтальмохирургия', '#детскоезрение','#детскийофтальмолог', '#офтальмологмосква',\
		   '#дакриоцистит', '#дакриоциститноворожденных','#дакриоциститмассаж','#дакриоциститлечение',\
		   '#дакриоцисториностомия', '#зондированиеносослёзногоканала','#зондированиеноворождённых',\
		   '#нистагм', '#лечениенистагма','#нистагмоперация', '#нистагмъ','#близорукость',\
		   '#миопия', '#лечениеблизорукости', '#близорукостьнеприговор','#близоркостьлечение',\
		   '#близорукостьонатакая', '#близорукостьнепорок','#близорукостьудетей','#дальнозоркость',\
		   '#гиперметропия', '#лечениедальнозоркости','#дальнозоркостьлечение','#дальнозоркостьудетей',\
		   '#дальнозоркости','#косоглазие','#страбизм', '#лечениекосоглазия', '#косоглазиелечение',\
		   '#косоглазиеэтосексуально','#косоглазиебишкек', '#косоглазиенепорок', '#косоглазие дети',\
		   '#косоглазиеэтомодно','#астигматизм', '#астигматизмлечение', '#астигматизмудетей','#амблиопия',\
		   '#амблиопиявысокойстепени','#амблиопиямосква', '#катаракта','#катарактавладивосток',\
		   '#катарактачелябинск','#катаракта лечение москва','#катарактаоперация', '#глаукома',\
		   '#глаукомалечение', '#глаукомавладивосток','#глаукомачелябинск', '#птоз',\
		   '#птозверхнеговека', '#птозвека','#птозвек', '#птозанет','#лазернаякоррекция',\
		   '#лазернаякоррекциязрения', '#лазернаякоррекциязрениямосква','#лазернаякоррекцияакция',\
		   '#лазернаякоррекциямосква', '#лазернаякоррекциязренияомикрон','#лазернаякоррекцияскидки',\
		   '#lasik', '#фрк', '#smile', '#ласик', '#ласикмосква', '#ячмень', '#халязион', '#хобби'"


#preprocessing hastags for regex
words=words_str.replace(',','|').replace("'","").replace(" ", "")

#------------------------------------------------------------------------------------
#------------------------------------------------------------------------------------
#Searches in posts
"""
IS USED IN FUNCTIONS 
    find_words(df_row,
               words = list_of_keywords,
               feature = 'post',
               flag = ['count' or 'set'])
"""
list_of_keywords_posts = words 

#------------------------------------------------------------------------------------
#------------------------------------------------------------------------------------
#Searches in interests
"""
IS USED IN FUNCTIONS 
    find_words(df_row,
               words = words_nohashtag,
               feature = ['interests' or ],
               flag = ['count' or 'set'])
"""
words_nohashtag=words.replace('#','')

#------------------------------------------------------------------------------------
#------------------------------------------------------------------------------------
#Searches in faculty_name
"""
IS USED IN FUNCTIONS 
    find_words(df_row,
               words = list_of_keywords_med,
               feature = 'faculty_name',
               flag = 'count')
"""
list_of_keywords_med_faculty = 'Медицин|Лече|педиатр'

#------------------------------------------------------------------------------------
#------------------------------------------------------------------------------------
#Serches in work_place
"""
IS USED IN FUNCTIONS 
    find_words(df_row,
               words = [doctors_keyword or kosmet_keyword or veter_keyword or oculist_keyword],
               feature = 'work_place',
               flag = 'count')
"""
doctors_keyword_work= "КубГМУ|КрасГМУ|НГМУ|ВолгГМУ|РязГМУ|СПбГМУ|СПбГПМУ|МГМУ|РНИМУ|Сеченова|\
					  |Пирогова|Павлова|Клиника доктора Куренкова|педиатр|\
					  |офтальмолог|зрени|глаз|окулист|госпиталь|клиника|детск|Clinic|medical|optic|опти"
 
kosmet_keyword_work=  "Космети|Космето|MakeUp|Make-Up|ORIFLAME|beauty|Mary Kay|грим\
					  |ресни|Lash|salon|ВИЗАЖИСТ|СТИЛИСТ|Макияж|Makiazh|ПИЛИНГ|красот|татуаж|Парфюм|дермат|клиент"
 
veter_keyword_work=   "Ветеринар"
 
oculist_keyword_work= "Клиника доктора Куренкова|офтальмолог|зрени|глаз|окулист|Три-З"

#------------------------------------------------------------------------------------
#------------------------------------------------------------------------------------
#Searches in activities and interests
"""
IS USED IN FUNCTIONS 
    find_words(df_row,
               words = [kosmet_keyword_act or oculist_keyword_act or ...int or words_nohashtag],
               feature = ['activities' or 'interests'],
               flag = 'count')
"""
kosmet_keyword_act= "Космети|makeupgrim|MakeUp|Make-Up|lashes-make|shoplinza|magazin\
                    |optika_zorkiy|Lash|Makiazh|Макияж|лосьон|педиатр\
                    НАРАЩИВАНИЕ ВОЛОС|бров|волос|ГУБЫ|ГУБов|ГУБa|ПИЛИНГ|красот|татуаж|Парфюм|дермат|клиент"

oculist_keyword_act="глазная болезн|глазные болезн|глазных болезн|глазной центр\
                    |глазного центра|глазная Клиника|педиатр"

oculist_keyword_int=oculist_keyword_act

kosmet_keyword_int=kosmet_keyword_act

words_nohashtag=words.replace('#','')
#------------------------------------------------------------------------------------
#------------------------------------------------------------------------------------
#Searches in websites
"""
IS USED IN FUNCTIONS 
    find_words(df_row,
               words = [doctors_keyword_web or kosmet_keyword_web],
               feature = 'site',
               flag = 'exist')
"""
doctors_keyword_web="boligolovv|stavropol.s-classclinic|mamatov|medihost|s-classclinic"
kosmet_keyword_web= "unabella|makeupgrim|MakeUp|Make-Up|lashes-make|shoplinza|magazin\
                    |optika_zorkiy|Lash|Makiazh|Макияж"

#------------------------------------------------------------------------------------
#------------------------------------------------------------------------------------
#Searches for kids doctors
"""
IS USED IN FUNCTIONS 
    find_words(df_row,
               words = [oculist_keyword_kid],
               feature = 'site',
               flag = 'exist')
"""
oculist_keyword_kid="детск|педиатр"






















